{
    "generated_images": {
        "1star": {
            "path": "Sample_Character/Sample_Character_1star.png"
        },
        "2star": {
            "path": "Sample_Character/Sample_Character_2star.png"
        }
    },
    "name": "Sample Character",
    "species": "Vampire",
    "skills": "animal training, palmistry, cleaning",
    "concept": "With meticulously braided dark hair streaked with crimson, she's a highly sought-after vampire matriarch within nomadic beast-herding tribes, offering insightful futures from the calluses on weathered hands while discreetly ensuring her kin's lairs remain spotless. Though she may appear aloof, this immortal is exceptionally maternal, fiercely protective of the monstrous steeds that allow her nomadic family to range through the untamed steppes, and by extension, any under her protection.",
    "immutables": "1girl, vampire, mature female, large breasts, athletic, tall, dark skin, braided hair, streaked hair, crimson streaks, black hair, red eyes, calluses",
    "outfit": "nomadic clothing, beast herder garb, simple dress, leather boots, tribal accessories, weathered gloves",
    "personality": "Sample approaches all beings, human or animal, with the calculated empathy of a palm reader. She believes every creature's path is written in their lines, be they wrinkles or furrows. Years of cleaning up after unruly beasts have instilled in her a fastidious nature; she can't abide a mess, whether it's physical or emotional. A tic: She unconsciously traces the lines on the palms of sleeping creatures, muttering interpretations under her breath.",
    "backstory": "Born a vampire to a nomadic tribe of beast herders, Sample's path was etched in shadow and claw from the start. The elders taught her the ancient art of palmistry, believing the life force pulsing through the veins could be read in the hands – a potent ability for a vampire. However, it was the grimoires kept by the elders (scribbled over time) that became the most potent tool in understanding the nature of beasts, from simple dogs to terrifying winged creatures. As her gift grew, so did her practical duties: training the tribe's monstrous mounts and cleaning up the… messes. She excelled, her enhanced senses perfect for scenting out ailments and emotional states, her enhanced strength essential for keeping creatures and her surroundings in order. Over centuries, Sample rose from apprentice to matriarch, teaching the younger generations to read palms, respect nature, and leave no trace but legend.",
    "archetype": "Nocturnal Beast Tamer"
}